faris1702/SC2079-STM32-Robot/main_task2.c
}



void forward(float target_rpm, float target_distance, int delay, int flag){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, pid_k_left, 0.0f, 0.0f, 0);
	setPID(&pid_right, pid_k_right, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		rotate_wheel(SERVO_LEFT+10);
		osDelay(500);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(500);
		servo_prev = SERVO_LEFT;
	}
	//-------------------------------------------------------

	for (;;){
		if (emergency_stop){
			MotorStop_both();
			break;
		}

		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm + RPM_OFFSET) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//-----------------------------------------------------------

		//flag = 1 is used to indicate that the function was called to stop the robot
		//-------------------- Check distance travelled ------------------
		  if (distance_travelled >= target_distance){
			  if (flag){
				  reverse(40.0f, 1.0f, 40, 1);
			  }
			  else{
				  MotorStop_both();
			  }
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void forward_until(float target_rpm, float target_distance, int delay, int flag){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, pid_k_left, 0.0f, 0.0f, 0);
	setPID(&pid_right, pid_k_right, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		buzzerOn(200);
		rotate_wheel(SERVO_LEFT+10);
		osDelay(100);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(100);
		servo_prev = SERVO_LEFT;
	}
	//-------------------------------------------------------

	for (;;){
		if (emergency_stop){
			MotorStop_both();
			break;
		}
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm + RPM_OFFSET) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------- End of Distance Calculation ------------------


		//-------------------- Check distance travelled ------------------
		  if (us_dist <= target_distance){
			  if (flag){
				  reverse(40.0f, 1.0f, 40, 1);
			  }
			  else{
				  MotorStop_both();
			  }
			  break;
		  }
		//-----------------------------------------------------------------


		  osDelay(delay);
	}
}

void forward_or_until(float target_rpm, float target_distance, float us_distance, int delay, int flag){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, pid_k_left, 0.0f, 0.0f, 0);
	setPID(&pid_right, pid_k_right, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		buzzerOn(200);
		rotate_wheel(SERVO_LEFT+10);
		osDelay(100);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(100);
		servo_prev = SERVO_LEFT;
	}
	//-------------------------------------------------------

	for (;;){
		if (emergency_stop){
			MotorStop_both();
			break;
		}
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm + RPM_OFFSET) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------- End of Distance Calculation ------------------


		//-------------------- Check distance travelled ------------------
		  if ((us_dist <= us_distance) || (distance_travelled >= target_distance)){
			  if (flag){
				  reverse(40.0f, 1.0f, 40, 1);
			  }
			  else{
				  MotorStop_both();
			  }
			  break;
		  }
		//-----------------------------------------------------------------


		  osDelay(delay);
	}
}

void forward_until_right_ir(float target_rpm, float target_distance, int delay, int flag){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, pid_k_left, 0.0f, 0.0f, 0);
	setPID(&pid_right, pid_k_right, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		buzzerOn(200);
		rotate_wheel(SERVO_LEFT+10);
		osDelay(100);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(100);
		servo_prev = SERVO_LEFT;
	}
	//-------------------------------------------------------

