faris1702/SC2079-STM32-Robot/main_task2.c
    osDelay(250);
  }
  /* USER CODE END show */
}

/* USER CODE BEGIN Header_motors */
/**
* @brief Function implementing the MotorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_motors */
void motors(void *argument)
{
  /* USER CODE BEGIN motors */

	int flag = 0;
	int simulation = 0;
	int pic1, pic2;
	float vert_dist_offset = 85.0f;



	//---------- Testing --------------
	// half turn, half turn
	// 38 forward, 13.5 left - 1st obstacle - 35 degree turn - left/right
//	convert_from_angle(-30);
//    forwardTurn(servo_curr, 35, 100, 40);
//    osDelay(100);
//    convert_from_angle(30);
//    forwardTurn(servo_curr, 35, 100, 40);

	// full 90 deg turn
	// left - 28 left, 34.5 up
//	convert_from_angle(30);
//	forwardTurn(servo_curr, 81, 200, 40);

	//uturn - 173.5
	// right, 65cm right, 10cm up
//	convert_from_angle(30);
//    forwardTurn(servo_curr, 173.5, 200, 40);
//    osDelay(100);


	//forward until
	// 35cm - 23 ~ 25cm
	// 45cm - 35 ~ 36cm
//	forward_until(200, 45, 40, 0);
	//---------------------------------

	simulation = 0;
	// --------------- Start -----------------
	osDelay(2000);//delay for ultrasonic init
	rotate_wheel(SERVO_LEFT+10);
	osDelay(500);
	rotate_wheel(SERVO_MIDDLE);
	osDelay(500);


	for (;;){
		if (!simulation){
			if (have_instruction){
				have_instruction = 0;
				buzzerOn(300);
				break;
			}
		}
		else{
			if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == RESET){
				buzzerOn(500);
				osDelay(1500);
				break;
			}
		}
	}
	// ------------------------------------------

//	forward(180, 100, 40, 0);
  /* Infinite loop */
  for(;;)
  {

	  //***** Un-comment to stop *****
//	  osDelay(1000);
//	  continue;
	  //*****************************

	  //------------- Stop the robot after all steps complete -------------------
	  if (flag){
		  osDelay(1000);
		  continue;
	  }
	  //-------------------------------------------------------------------------

	  // --------------- Hard code to test ---------------------
	  if (simulation){
		  // Move to 1st obstacle
		  forward_until(200, 40, 40, 0);
		  vert_dist += distance_travelled;
		  vert_dist_int = vert_dist;

		  // 1st obstacle
		  buzzerOn(1000);
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 40, 200, 40);
		  osDelay(150);
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 45, 200, 40);
		  osDelay(150);

		  // 2nd obstacle
		  forward_until(200, 45, 40, 0);
	//	  osDelay(200);
		  buzzerOn(1000);
		  vert_dist += distance_travelled;
		  vert_dist_int = vert_dist;

		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 90, 150, 40);
		  osDelay(150);

		  // move to edge of 2nd obstacle
		  reverse_until_right_ir(200, 40, 40, 0);
		  osDelay(150);
		  forward_until_right_ir(200, 40, 40, 0);
		  osDelay(150);

		  // u-turn
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 173.5, 150, 40);
		  osDelay(150);

		  // straight line at the back
		  forward_until_right_ir(200, 40, 40, 0);
		  osDelay(150);
		  horz_dist = distance_travelled/2;
		  horz_dist_int = horz_dist;


		  convert_from_angle(30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  // Now otw back
		  // straight line
		  forward(200, vert_dist, 40, 0);
		  osDelay(150);

		  //turning to carpark
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  forward_or_until(200, 10, 15, 40, 0);

		  buzzerOn(1000);
		  flag = 1;
		  continue;
	  }
	  // -------------------------------------------------------

	  // ----------------- Non-Simulation, with UART comms ----------------------
	  //-------------------- Move to first obstacble ----------------------------
	  vert_dist += us_dist;
	  vert_dist_int = vert_dist;
	  forward_until(200, 45, 40, 0);
//	  osDelay(200);
	  // ------------------------------------------------------------------------

	  // ------ Obstacle 1: Ask RPI to take pic and receive direction -------
	  HAL_UART_Transmit(&huart3, "SNAP\r\n", 5, 0xFFFF);
	  buzzerOn(1000); // for simulation only, remove for real test

	  if (instruction[1] == 'L'){
		  pic1 = LEFT;
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 40, 200, 40);
		  osDelay(150);
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 45, 200, 40);
	  }
	  else{ //turn right
		  pic1 = RIGHT;
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 40, 200, 40);
		  osDelay(150);
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 45, 200, 40);
	  }
	  have_instruction = 0;


	  // -----------------------------------------------------------------------

	  // ----------------------- Move to obstacle 2 ----------------------------
	  vert_dist += 38 + us_dist;
	  vert_dist_int = vert_dist;
	  forward_until(200, 45, 40, 0);
	  // -----------------------------------------------------------------------


	  // ------ Obstacle 2: Ask RPI to take pic and receive direction -------
	  HAL_UART_Transmit(&huart3, "SNAP\r\n", 5, 0xFFFF);
	  buzzerOn(1000);  // for simulation only, remove for real test

	  if (instruction[2] == 'L'){
		  pic2 = LEFT;
		  if (pic1 == LEFT){ // turn left extra
			  convert_from_angle(-30);
			  forwardTurn(servo_curr, 90, 150, 40);
			  osDelay(150);
		  }
		  else{  //turn left less
			  convert_from_angle(-30);
			  forwardTurn(servo_curr, 85, 150, 40);
			  osDelay(150);
		  }
	  }
	  else{
		  pic2 = RIGHT;
		  if (pic1 == LEFT){   // turn right less
			  convert_from_angle(30);
			  forwardTurn(servo_curr, 85, 150, 40);
			  osDelay(150);
		  }
		  else{  // turn right more
			  convert_from_angle(30);
			  forwardTurn(servo_curr, 90, 150, 40);
			  osDelay(150);
		  }
	  }

	  // -----------------------------------------------------------------------


