faris1702/SC2079-STM32-Robot/main_task2.c
	  // ------------------- Go to the parking spot -----------------
	  if (pic2 == LEFT){
		  // Go to the end of 2nd obstacle from the front
		  reverse_until_right_ir(200, 40, 40, 0);

		  forward_until_right_ir(200, 40, 40, 0);
		  osDelay(150);

		  // U-Turn
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 173.5, 150, 40);
		  osDelay(150);

		  // Go to the other end of 2nd obstacle from the back
		  forward_until_right_ir(200, 40, 40, 0);
		  osDelay(150);
		  horz_dist = distance_travelled/2;
		  horz_dist_int = horz_dist;

		  // Turn right at the end of the 2nd obstacle
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  // Go straight
		  forward(200, vert_dist-vert_dist_offset, 40, 0);
		  osDelay(150);

		  //Turn the car to park + adjustments
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  forward_or_until(200, 10, 15, 40, 0);
	  }

	  else{
		  // Go to the end of 2nd obstacle from the front
		  reverse_until_left_ir(200, 40, 40, 0);

		  forward_until_left_ir(200, 40, 40, 0);
		  osDelay(150);

		  // U-Turn
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 173.5, 150, 40);
		  osDelay(150);

		  // Go to the other end of 2nd obstacle from the back
		  forward_until_left_ir(200, 40, 40, 0);
		  osDelay(150);
		  horz_dist = distance_travelled/2;
		  horz_dist_int = horz_dist;

		  // Turn right at the end of the 2nd obstacle
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  // Go straight
		  forward(200, vert_dist-vert_dist_offset, 40, 0);
		  osDelay(150);

		  //Turn the car to park + adjustments
		  convert_from_angle(-30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);
		  convert_from_angle(30);
		  forwardTurn(servo_curr, 83.5, 150, 40);
		  osDelay(150);

		  forward_or_until(200, 10, 15, 40, 0);
	  }

	  // ----------------------------------------------------------------


	  buzzerOn(1000);
	  flag = 1;
	  HAL_UART_Transmit(&huart3, "FINISH\r\n", 5, 0xFFFF);

  }
  /* USER CODE END motors */
}

/* USER CODE BEGIN Header_encoder */
/**
* @brief Function implementing the EncoderTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder */
void encoder(void *argument)
{
  /* USER CODE BEGIN encoder */
  /* Infinite loop */
  // --------------- Right Motor (Motor A) --------------------------
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

  int cnt1A, cnt2A;
  uint32_t tickA;

  cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
  tickA = HAL_GetTick();
  uint8_t display1[20];
  uint8_t display2[20];
  uint16_t dirA;
  float a = 0.95f;

  for(;;)
  {
    if (HAL_GetTick() - tickA > 40L){
    	cnt2A = __HAL_TIM_GET_COUNTER(&htim2);
    	if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2)){
    		if (cnt2A < cnt1A)
    			motor_right_encoder = cnt1A - cnt2A;
    		else
    			motor_right_encoder = (65535 - cnt2A) + cnt1A;
    	}
    	else{
    		if (cnt2A > cnt1A)
    			motor_right_encoder = cnt2A - cnt1A;
    		else
    			motor_right_encoder = (65535 - cnt1A) + cnt2A;
    	}

    	//------------------------------- with LPF ---------------------------------------
    	if (motor_right_encoder > 250){
    		motor_right_encoder = 0;
    		motor_right_encoder_lpf = 0;
    	}
    	total_right_encoder += motor_right_encoder;
    	motor_right_encoder *= 25;
    	motor_right_rpm = motor_right_encoder / 22.0f; // 60/1320 = 1/22

    	motor_right_encoder_lpf = (motor_right_encoder * (1-a)) + (prev_right_encoder * a);
    	prev_right_encoder = motor_right_encoder_lpf;  // for LPF
    	motor_right_rpm_lpf = motor_right_encoder_lpf / 22.0f; // 60/1320 = 1/22
    	motor_right_rpm_lpf_int = motor_right_rpm_lpf;
    	//---------------------------------------------------------------------------------

    	motor_right_rpm_int = motor_right_rpm;
    	dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2);

    	//---------- Reset Procedure ------------
    	cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
	    tickA = HAL_GetTick();
	    //---------------------------------------
    }
  }
  /* USER CODE END encoder */
}

/* USER CODE BEGIN Header_encoder_B */
/**
* @brief Function implementing the EncoderBTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder_B */
void encoder_B(void *argument)
{
  /* USER CODE BEGIN encoder_B */
	// --------------- Left Motor (Motor B) --------------------------
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

	int cnt1A, cnt2A;
	uint32_t tickA;

	cnt1A = __HAL_TIM_GET_COUNTER(&htim3);
	tickA = HAL_GetTick();
	uint8_t display1[20];
	uint8_t display2[20];
	uint16_t dirA;
	float a = 0.95f;

	char sbuf[64];

	for(;;)
	{
	if (HAL_GetTick() - tickA > 40L){
		cnt2A = __HAL_TIM_GET_COUNTER(&htim3);
		if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3)){
			if (cnt2A < cnt1A)
				motor_left_encoder = cnt1A - cnt2A;
			else
				motor_left_encoder = (65535 - cnt2A) + cnt1A;
		}
		else{
			if (cnt2A > cnt1A)
				motor_left_encoder = cnt2A - cnt1A;
			else
				motor_left_encoder = (65535 - cnt1A) + cnt2A;
		}


		//---------------------- with LPF --------------------------
		if (motor_left_encoder > 250){
			motor_left_encoder = 0;
			motor_left_encoder_lpf = 0;
		}
		total_left_encoder += motor_left_encoder;
		motor_left_encoder *= 25;
		motor_left_rpm = motor_left_encoder / 22.0f;  //  60/1320 = 1/22

		motor_left_encoder_lpf = (motor_left_encoder * (1-a)) + (prev_left_encoder * a);  //for LPF
		prev_left_encoder = motor_left_encoder_lpf;  //for LPF
		motor_left_rpm_lpf = motor_left_encoder_lpf / 22.0f;  //  60/1320 = 1/22
		motor_left_rpm_lpf_int = motor_left_rpm_lpf;
		//-----------------------------------------------------------

		motor_left_rpm_int = motor_left_rpm;
		dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3);
		dirA = !(dirA);

